In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Employeeh (id int, name varchar(255), salary int, departmentId int)

In [ ]:
Create table If Not Exists Department (id int, name varchar(255))

In [ ]:
insert into Employeeh (id, name, salary, departmentId) values ('1', 'Joe', '85000', '1')

In [ ]:
insert into Employeeh (id, name, salary, departmentId) values ('2', 'Henry', '80000', '2')

In [ ]:
insert into Employeeh (id, name, salary, departmentId) values ('3', 'Sam', '60000', '2')

In [ ]:
insert into Employeeh (id, name, salary, departmentId) values ('4', 'Max', '90000', '1')

In [ ]:
insert into Employeeh (id, name, salary, departmentId) values ('5', 'Janet', '69000', '1')

In [ ]:
insert into Employeeh (id, name, salary, departmentId) values ('6', 'Randy', '85000', '1')

In [ ]:
insert into Employeeh (id, name, salary, departmentId) values ('7', 'Will', '70000', '1')

In [ ]:
insert into Department (id, name) values ('1', 'IT')

In [ ]:
insert into Department (id, name) values ('2', 'Sales')

In [ ]:
select * from department

+----+-------+
| id | name  |
+----+-------+
| 1  | IT    |
+----+-------+
| 2  | Sales |
+----+-------+

In [ ]:
select * from employeeh

+----+-------+--------+--------------+
| id | name  | salary | departmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 85000  | 1            |
+----+-------+--------+--------------+
| 2  | Henry | 80000  | 2            |
+----+-------+--------+--------------+
| 3  | Sam   | 60000  | 2            |
+----+-------+--------+--------------+
| 4  | Max   | 90000  | 1            |
+----+-------+--------+--------------+
| 5  | Janet | 69000  | 1            |
+----+-------+--------+--------------+
| 6  | Randy | 85000  | 1            |
+----+-------+--------+--------------+
| 7  | Will  | 70000  | 1            |
+----+-------+--------+--------------+

## Write a solution to find the employees who are high earners in each of the departments.

In [ ]:
select departmentid, salary
from employeeh group by departmentid, salary

+--------------+--------+
| departmentId | salary |
+--------------+--------+
| 1            | 69000  |
+--------------+--------+
| 1            | 70000  |
+--------------+--------+
| 1            | 85000  |
+--------------+--------+
| 1            | 90000  |
+--------------+--------+
| 2            | 60000  |
+--------------+--------+
| 2            | 80000  |
+--------------+--------+

In [ ]:
select departmentid,salary, row_number() over (partition by departmentid order by departmentid, salary desc) rn
from employeeh 
group by departmentid,salary

+--------------+--------+----+
| departmentId | salary | rn |
+--------------+--------+----+
| 1            | 90000  | 1  |
+--------------+--------+----+
| 1            | 85000  | 2  |
+--------------+--------+----+
| 1            | 70000  | 3  |
+--------------+--------+----+
| 1            | 69000  | 4  |
+--------------+--------+----+
| 2            | 80000  | 1  |
+--------------+--------+----+
| 2            | 60000  | 2  |
+--------------+--------+----+

In [ ]:
select departmentid, salary from (
    select departmentid,salary, row_number() over (partition by departmentid order by departmentid, salary desc) rn
    from employeeh group by departmentid,salary
)
where rn<=3

+--------------+--------+
| departmentid | salary |
+--------------+--------+
| 1            | 90000  |
+--------------+--------+
| 1            | 85000  |
+--------------+--------+
| 1            | 70000  |
+--------------+--------+
| 2            | 80000  |
+--------------+--------+
| 2            | 60000  |
+--------------+--------+

In [ ]:
with t as (
    select departmentid, salary from (
    select departmentid,salary, row_number() over (partition by departmentid order by departmentid, salary desc) rn
    from employeeh group by departmentid,salary
    )
    where rn<=3
)

-- select * from employeeh where (departmentid, salary) in t
select d.name as department, e.name as employee, e.salary 
from t, employeeh e, department d 
where e.departmentid=t.departmentid and e.salary= t.salary and d.id=e.departmentid

+------------+----------+--------+
| department | employee | salary |
+------------+----------+--------+
| IT         | Joe      | 85000  |
+------------+----------+--------+
| Sales      | Henry    | 80000  |
+------------+----------+--------+
| Sales      | Sam      | 60000  |
+------------+----------+--------+
| IT         | Max      | 90000  |
+------------+----------+--------+
| IT         | Randy    | 85000  |
+------------+----------+--------+
| IT         | Will     | 70000  |
+------------+----------+--------+